app/views/projects/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."project_id" = ? AND (url LIKE '%jpg%' OR url LIKE '%png%') ORDER BY "items"."id" DESC LIMIT ?  [["project_id", 10], ["LIMIT", 1]]
---

    <% @project.items.each do |item| %>