app/views/items/add.html.erb

SELECT "items".* FROM "items" WHERE "items"."project_id" = ?  [["project_id", 2]]
---

  <% @project.items.each do |item| %>