app/controllers/designers_controller.rb

  def index
    @designers = Designer.all
---
SELECT "designers".* FROM "designers"

  def show
    @designer = Designer.find(params[:id])
---
SELECT  "designers".* FROM "designers" WHERE "designers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @designer = Designer.new

    @designer.first_name = params[:first_name]
    @designer.last_name = params[:last_name]
    @designer.company_id = params[:company_id]
    @designer.role = params[:role]

    save_status = @designer.save
---
INSERT INTO "designers" ("first_name", "last_name", "email", "company_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)