app/controllers/items_controller.rb

INSERT INTO "items" ("project_id", "name", "description", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["project_id", 1], ["name", "1"], ["description", "r"], ["url", "LiveFit_Edits.docx"], ["created_at", 2017-05-10 17:57:20 UTC], ["updated_at", 2017-05-10 17:57:20 UTC]]
---
  def create
    @item = Item.new

    @item.project_id = params[:project_id]
    @item.name = params[:url].original_filename
    @item.description = params[:description]
    @item.url = params[:url]

    save_status = @item.save