app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."project_id" = ? AND (url LIKE '%jpg%' OR url LIKE '%png%') ORDER BY "items"."id" DESC LIMIT ?  [["project_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."project_id" = ? AND "items"."url like ?" IN ('%jpg%', '%png%')  [["project_id", 10]]
---
  def show
    @project = Project.find(params[:id])

    if @project.items.where('url LIKE ? OR url LIKE ?', "%jpg%", "%png%").count > 0

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def review
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def revise_submit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("title", "project_type", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["project_type", ""], ["description", ""], ["status", ""], ["created_at", 2017-05-10 01:17:08 UTC], ["updated_at", 2017-05-10 01:17:08 UTC]]
---
  def create
    @project = Project.new

    @project.title = params[:title]
    @project.project_type = params[:project_type]
    @project.description = params[:description]
    @project.status = params[:status]
    @project.version = params[:version]
    @project.designer_id = params[:designer_id]
    @project.hours_used = params[:hours_used]

    save_status = @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "title" = ?, "description" = ?, "status" = ?, "version" = ?, "hours_used" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "Graphic make me more"], ["description", "gggg"], ["status", "In Revision"], ["version", 2.0], ["hours_used", nil], ["updated_at", 2017-05-11 18:59:02 UTC], ["id", 13]]
---
  def update
    @project = Project.find(params[:id])

    @project.title = params[:title]
    @project.project_type = params[:project_type]
    @project.description = params[:description]
    @project.status = params[:status]
    @project.version = params[:version]
    @project.designer_id = params[:designer_id]
    @project.hours_used = params[:hours_used]

    save_status = @project.save